TEST1/0.orig/Te
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      Te;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    left     { type symmetryPlane; }
    right    { type symmetryPlane; }
    front    { type symmetryPlane; }
    back     { type symmetryPlane; }

donorSubstrate
    {
        type            fixedValue;
        value           uniform 300;  // Heat sink effect
    }
    

        receiver
    {
        type            zeroGradient;  // OR fixedValue with higher temp
        // Alternative: type fixedValue; value uniform 320;
    }
}

// ✅ CORRECTED REASONING:

// - donorSubstrate (bottom): Transparent substrate acts as heat sink

// - receiver (top): Receiver substrate - minimal thermal interference

// - This allows proper temperature buildup in Ti donor film (8.0-8.0714 µm)

// - Laser enters from bottom, heats film, material ejects upward

// ************************************************************************* //
