TEST1/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1e-6; // coordinates in micrometers

// ✅ CORRECTED LIFT GEOMETRY (bottom to top) - matches experimental physics:

// y0 = 0.0000     - Transparent donor substrate bottom (glass/quartz)

// y1 = 8.0000     - Donor substrate top / Ti film bottom

// y2 = 8.0714     - Ti film top (71.4 nm thick) / Air gap bottom

// y3 = 20.0714    - Air gap top (12 µm) / Receiver substrate bottom

// y4 = 28.0714    - Receiver substrate top (8 µm)

vertices
(

    // y0 = 0.0000 (transparent donor substrate bottom)

    (0   0.0000  0)  (50  0.0000  0)  (50  0.0000 10)  (0   0.0000 10)

 

    // y1 = 8.0000 (donor substrate top / Ti film bottom)
    (0   8.0000  0)  (50  8.0000  0)  (50  8.0000 10)  (0   8.0000 10)

    // y2 = 8.0714 (Ti film top / air gap bottom) - 71.4 nm thick film
    (0   8.0714  0)  (50  8.0714  0)  (50  8.0714 10)  (0   8.0714 10)

    // y3 = 20.0714 (air gap top / receiver substrate bottom)
    (0  20.0714  0)  (50 20.0714  0)  (50 20.0714 10)  (0  20.0714 10)
    
    // y4 = 28.0714 (receiver substrate top)
    (0  28.0714  0)  (50 28.0714  0)  (50 28.0714 10)  (0  28.0714 10)

);
blocks

(
    // Resolution: 250 nm in X,Z (captures 3.2µm laser spot); 4.76 nm in Ti film Y-direction

    hex ( 0  3  2  1   4  7  6  5)   ( 40 200  40)  simpleGrading (1 1 1)  // Donor substrate (8 µm): 0.2 µm/cell in Y

    hex ( 4  7  6  5   8 11 10  9)   ( 40 200  15)  simpleGrading (1 1 1)  // Ti film (71.4 nm): 4.76 nm/cell in Y, 3.5 cells/penetration depth

    hex ( 8 11 10  9  12 15 14 13)   ( 40 200  60)  simpleGrading (1 1 1)  // Air gap (12 µm): 0.2 µm/cell in Y

    hex (12 15 14 13  16 19 18 17)   ( 40 200  40)  simpleGrading (1 1 1)  // Receiver substrate (8 µm): 0.2 µm/cell in Y

);

edges ();

 

boundary

(

    // Symmetry planes (external boundaries only)

    left          { type symmetryPlane; faces ((0 3 7 4)(4 7 11 8)(8 11 15 12)(12 15 19 16)); }

    right         { type symmetryPlane; faces ((1 5 6 2)(5 9 10 6)(9 13 14 10)(13 17 18 14)); }

    front         { type symmetryPlane; faces ((0 4 5 1)(4 8 9 5)(8 12 13 9)(12 16 17 13)); }

    back          { type symmetryPlane; faces ((3 2 6 7)(7 6 10 11)(11 10 14 15)(15 14 18 19)); }

 

    // ✅ CORRECTED: Laser enters through donor substrate at BOTTOM, deposits on receiver at TOP

    donorSubstrate  { type wall;  faces ((0 3 2 1)); }      // BOTTOM - transparent donor substrate (laser entry)

    receiver        { type wall;  faces ((16 19 18 17)); }  // TOP - receiver substrate (deposition target)
);

mergePatchPairs();

// ************************************************************************* //
