TEST1/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "alpha.*"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-06;
        relTol          0.0;
        maxIter         50;

        nAlphaCorr      1;              // Keep at 1
        nAlphaSubCycles 3;              // Increased to stabilise transport
        cAlpha          0.5;            // Softer compression to avoid overshoot
        icAlpha         0;
        scAlpha         0;
        compressionLimiter 0.5;         // Caps phic relative to |phi|
        MULESCorr       true;
        nLimiterIter    3;
        alphaApplyPrevCorr false;
        sharpeningScheme standard;
        thinFilmCoeff   0.0;
    }

    p_rgh
    {
        solver          GAMG;
        smoother        DICGaussSeidel;
        tolerance       1e-8;
        relTol          0.01;
        maxIter         100;
        nPreSweeps      0;
        nPostSweeps     2;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 20;
        agglomerator    faceAreaPair;
        mergeLevels     2;
        relaxationFactor 0.2;
    }

    p_rghFinal
    {
        $p_rgh;
        tolerance   1e-8;
        relTol      0;
    }
    
    "U.*"
   {
            solver      smoothSolver;
            smoother    symGaussSeidel;
	    nSweeps     2;
	    tolerance   1e-04;
	    relTol      0.5;
	    maxIter     200;
    }

    T
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        nSweeps         6;
        tolerance       1e-8;
        relTol          0.01;             // Allow 1% relative convergence
        maxIter         1000;             // Increased iteration limit
        minIter         3;                // Ensure minimum work
    }

    TFinal
    {
        $T;
        tolerance       1e-9;
        relTol          0;
        maxIter         1000;
    }

    Te
    {
         solver          smoothSolver;
        smoother        symGaussSeidel;
        nSweeps         6;
        tolerance       1e-8;
        relTol          0;
        maxIter         1000;
        minIter         3;
    }

    Tl
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        nSweeps         6;
        tolerance       1e-8;
        relTol          0;
        maxIter         1000;
        minIter         3;
    }
}

PIMPLE
{
    momentumPredictor           true;
    nOuterCorrectors            3;           // REDUCE: was 2 (emergency mode)
    nCorrectors                 3;
    nNonOrthogonalCorrectors    2;

    residualControl
    {
        "alpha.*" { tolerance 1e-5;  relTol 0.01; }
        p_rgh     { tolerance 1e-5;  relTol 0.01; }
        U         { tolerance 1e-6;  relTol 0.01; }
        Te        { tolerance 5e-9;  relTol 0.0;  }   // thermal is stiff; be stricter
        Tl        { tolerance 5e-9;  relTol 0.0;  }
        T         { tolerance 1e-8;  relTol 0.01;  }   // if gas T exists
    }
    
    p_rghRefCell                0;
    p_rghRefValue               0;
}

relaxationFactors
{
    fields
    {
        p_rgh           0.2;
        "alpha.*"       0.5;
    }
    equations
    {
        U               0.7;
        T               0.5;
        Te              0.6;
        Tl              0.6;
        "alpha.*"       0.5;
        ".*Final"       0.9;
    }
}

// Pressure relaxation control
targetResP  0.5;

compInterFoamCoeffs
{
    // CRITICAL FIX: Remove artificial velocity clamping
    maxVelocity            0;         // DISABLED: was causing uniform 500 m/s field
    maxReasonableVelocity  800;       // Keep for validation warnings only
    
    defaultMetalDensity    4500;        
    defaultAirDensity      1.2;         
    maxInitialResidual     10;

    // Interface clamp settings
    enableAlphaClamp  false;
    minAlpha          0.001;
    maxAlpha          0.999;

    // CRITICAL FIX: Disable pressure clamping during active phase
    pressureClamp      true;          // DISABLED: was distorting physics
    maxPressure        1e8;
    minPressure       -1e5;

    // Density clamp settings
    densityClamp       false;
    maxDensity         10000;
    minDensity         0.5;

    // RAU clamp settings  
    enableRAUClamp     false;
    minRAU             1e-10;
    maxRAU             1e6;
    minRAUf            1e-14;
    maxRAUf            1e6;

    // Diagonal safety (keep this)
    minUEqnDiag        1e-9;

    // RELAX RESIDUAL TARGETS
    targetResU         0.1;
    targetResP         0.5;
}
